In [7]:
try:
    file = open('dat.csv','x')
    file.close()
except:
    print("The file is already there")

In [2]:
import pandas as pd
df = pd.read_csv('dat.csv')       #df = data frame
df

   Sn     Name  Age     Address       Phone
0   1      Ram   34        Dang  9866756745
1   2    Shyam   23       Palpa  9877654321
2   3  Rishika   22         Ktm  9866453432
3   4     Hari   27       Patan  9809887654
4   5    Demon   56  Biratnagar  9806254345

In [3]:
df.head(2)

   Sn   Name  Age Address       Phone
0   1    Ram   34    Dang  9866756745
1   2  Shyam   23   Palpa  9877654321

In [4]:
df.tail(3)

   Sn     Name  Age     Address       Phone
2   3  Rishika   22         Ktm  9866453432
3   4     Hari   27       Patan  9809887654
4   5    Demon   56  Biratnagar  9806254345

In [5]:
df.iloc[1:3]

   Sn     Name  Age Address       Phone
1   2    Shyam   23   Palpa  9877654321
2   3  Rishika   22     Ktm  9866453432

In [7]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')      
df

       Name  Age     Address       Phone
Sn
1       Ram   34        Dang  9866756745
2     Shyam   23       Palpa  9877654321
3   Rishika   22         Ktm  9866453432
4      Hari   27       Patan  9809887654
5     Demon   56  Biratnagar  9806254345

In [8]:
df.loc[1:4]

       Name  Age Address       Phone
Sn
1       Ram   34    Dang  9866756745
2     Shyam   23   Palpa  9877654321
3   Rishika   22     Ktm  9866453432
4      Hari   27   Patan  9809887654

In [9]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Name')      
df

         Sn  Age     Address       Phone
Name
Ram       1   34        Dang  9866756745
Shyam     2   23       Palpa  9877654321
Rishika   3   22         Ktm  9866453432
Hari      4   27       Patan  9809887654
Demon     5   56  Biratnagar  9806254345

In [10]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Name')      
df.loc["Shyam":"Hari"]

         Sn  Age Address       Phone
Name
Shyam     2   23   Palpa  9877654321
Rishika   3   22     Ktm  9866453432
Hari      4   27   Patan  9809887654

In [15]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')
df['Address'] == "Dang"

Sn
1     True
2    False
3    False
4    False
5    False
Name: Address, dtype: bool

In [16]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')
df[df['Address'] == "Dang"]

   Name  Age Address       Phone
Sn
1   Ram   34    Dang  9866756745

In [20]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')
data = df[df['Address'] == "Dang"]
data.to_csv('Newdata.csv')

In [23]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')      
list(df['Age'])

[34, 23, 22, 27, 56]

In [24]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')      
list(df['Age'])[4]

56

In [26]:
import pandas as pd
d = {"Name":["Ram","Shyam"],
    "Age":[24,45],
    "Add":["dang","ktm"]}
data = pd.DataFrame(d)
data

    Name  Age   Add
0    Ram   24  dang
1  Shyam   45   ktm

In [27]:
import pandas as pd
d = {"Name":["Ram","Shyam"],
    "Age":[24,45],
    "Add":["dang",""]}
data = pd.DataFrame(d)
data

    Name  Age   Add
0    Ram   24  dang
1  Shyam   45

In [28]:
import pandas as pd
d = {"Name":["Ram","Shyam"],
    "Age":[24,45],
    "Add":["dang",None]}
data = pd.DataFrame(d)
data

    Name  Age   Add
0    Ram   24  dang
1  Shyam   45  None

In [29]:
import pandas as pd
df = pd.read_csv('dat.csv',usecols = ["Sn",'Name','Phone'])      
df

   Sn     Name       Phone
0   1      Ram  9866756745
1   2    Shyam  9877654321
2   3  Rishika  9866453432
3   4     Hari  9809887654
4   5    Demon  9806254345

In [32]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')
df[(df['Address'] == "Dang") & (df['Age']>30)]

   Name  Age Address       Phone
Sn
1   Ram   34    Dang  9866756745

In [33]:
import pandas as pd
df = pd.read_csv('dat.csv',index_col = 'Sn')
df[(df['Address'] == "Dang") | (df['Age']>30)]

     Name  Age     Address       Phone
Sn
1     Ram   34        Dang  9866756745
5   Demon   56  Biratnagar  9806254345